sources/Catalogs/НастройкиОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиОрганизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписантыПоДокументам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текущий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Пол</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображениеВДокументах</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВремяЗвонков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПары</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/CommonModules/РаботаСПечатнымиФормами/Ext/Module.bsl
// Возвращает подписанта из настроек организации для служебки в печатной форме посещений
//
// Возвращаемое значение:
//   Массив[3] - на имя кого служебка, название организации и физическое лицо
//
Функция ПолучитьПодписантаДляМакетаСлужебкиПосещения() Экспорт

	МассивПодписантаДляСлужебкиПосещаемости = Новый Массив;
	ПодписантОрганизации = Справочники.НастройкиОрганизации.Выбрать();
	
	КоличествоОрганизаций = 0;
	
	Пока ПодписантОрганизации.Следующий() Цикл
	
		ТаблицаПодписантов = ПодписантОрганизации.ПодписантыПоДокументам;
	    Орг = ПодписантОрганизации.СокращенноеНаименование;
		КоличествоОрганизаций = КоличествоОрганизаций + 1;
		
	КонецЦикла;
	
	Если КоличествоОрганизаций = 0 Тогда
		
		Сообщить("Не задана организация!");
		 Возврат МассивПодписантаДляСлужебкиПосещаемости;
	
	КонецЕсли;
	
	Для НПодписант = 0 По ТаблицаПодписантов.Количество()-1 Цикл
	
		  Если ТаблицаПодписантов[НПодписант].Текущий Тогда
			
			МассивПодписантаДляСлужебкиПосещаемости.Добавить(ТаблицаПодписантов[НПодписант].ОтображениеВДокументах);
			МассивПодписантаДляСлужебкиПосещаемости.Добавить(Орг);
			МассивПодписантаДляСлужебкиПосещаемости.Добавить(ОбщиеФункции.ПросклонятьФИОДляДокументов(ТаблицаПодписантов[НПодписант].ФИО, ТаблицаПодписантов[НПодписант].Пол)[0]);
			Прервать;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Если МассивПодписантаДляСлужебкиПосещаемости.Количество() = 0 Тогда
	
		Сообщить("Не задан подписант от организации!");
	
	КонецЕсли;
	
	Возврат МассивПодписантаДляСлужебкиПосещаемости;
	
КонецФункции // ПолучитьПодписантаДляМакетаСлужебкиПосещения()
